/******************************************************************************************
 * Data Structures in C++
 * ISBN: 7-302-33064-6 & 7-302-33065-3 & 7-302-29652-2 & 7-302-26883-3
 * Junhui DENG, deng@tsinghua.edu.cn
 * Computer Science & Technology, Tsinghua University
 * Copyright (c) 2006-2013. All rights reserved.
 ******************************************************************************************/

#pragma once

/******************************************************************************************
 *将Queue各方法的实现部分，简洁地引入Queue.h
 *效果等同于将这些实现直接汇入Queue.h
 *在export尚未被编译器支持前，如此可实现H与CPP文件分离，以便课程讲解
******************************************************************************************/
