/******************************************************************************************
 * Data Structures in C++
 * ISBN: 7-302-33064-6 & 7-302-33065-3 & 7-302-29652-2 & 7-302-26883-3
 * Junhui DENG, deng@tsinghua.edu.cn
 * Computer Science & Technology, Tsinghua University
 * Copyright (c) 2006-2013. All rights reserved.
 ******************************************************************************************/

#pragma once

/******************************************************************************************
 * 打印输出PQ_List
 ******************************************************************************************/
template <typename T> //元素类型
void UniPrint::p ( PQ_List<T> & pq ) { //引用
   printf ( "%s*%d:\n", typeid ( pq ).name(), pq.size() ); //基本信息
   p ( ( List<T> & ) pq ); printf ( "\n" );
}
